Repository: mhmdwaelanwr/Markdown-Creator
Catalog: lib/l10n/app_*.arb
Languages: ar, fr, hi, ja

# appTitle
source: Markdown Studio Pro
ar: ستوديو مارك داون الاحترافي

source: Save to Library
ar: حفظ في المكتبة
fr: Enregistrer dans la bibliothèque
hi: लाइब्रेरी में सहेजें
ja: ライブラリに保存

source: Local Snapshots
ar: لقطات محلية
fr: Instantanés locaux
hi: स्थानीय स्नैपशॉट
ja: ローカルスナップショット

source: Clear Workspace
ar: مسح مساحة العمل
fr: Effacer l'espace de travail
hi: कार्यक्षेत्र साफ़ करें
ja: ワークスペースをクリア

source: Import Markdown
ar: استيراد مارك داون
fr: Importer du Markdown
hi: Markdown आयात करें
ja: Markdownをインポート

source: Social Preview Designer
ar: مصمم معاينة التواصل
fr: Concepteur d'aperçu social
hi: सोशल प्रीव्यू डिज़ाइनर
ja: ソーシャルプレビューデザイナー

source: GitHub Actions Generator
ar: مولد إجراءات جيت هاب
fr: Générateur d'actions GitHub
hi: GitHub Actions जनरेटर
ja: GitHub Actionsジェネレーター

source: Export Project (JSON)
ar: تصدير المشروع (JSON)
fr: Exporter le projet (JSON)
hi: प्रोजेक्ट निर्यात करें (JSON)
ja: プロジェクトをエクスポート (JSON)

source: Import Project (JSON)
ar: استيراد المشروع (JSON)
fr: Importer le projet (JSON)
hi: प्रोजेक्ट आयात करें (JSON)
ja: プロジェクトをインポート (JSON)

source: AI Settings
ar: إعدادات الذكاء الاصطناعي
fr: Paramètres IA
hi: AI सेटिंग्स
ja: AI設定

# generateFromCodebase
source: Scan Codebase (AI)
ar: تحليل الكود (بالذكاء الاصطناعي)
fr: Scanner le code (IA)
hi: कोडबेस स्कैन (AI)
ja: コードベーススキャン (AI)

source: Show Tour
ar: عرض الجولة
fr: Afficher la visite
hi: टूर दिखाएं
ja: ツアーを表示

# keyboardShortcuts
source: Shortcuts
ar: اختصارات لوحة المفاتيح
fr: Raccourcis
hi: शॉर्टकट
ja: ショートカット

source: About Developer
ar: حول المطور
fr: À propos du développeur
hi: डेवलपर के बारे में
ja: 開発者について

source: About App
ar: حول التطبيق
fr: À propos de l'app
hi: ऐप के बारे में
ja: アプリについて

# changeLanguage
source: Language
ar: اللغة
fr: Langue
hi: भाषा
ja: 言語

source: Settings
ar: الإعدادات
fr: Paramètres
hi: सेटिंग्स
ja: 設定

source: Cancel
ar: إلغاء
fr: Annuler
hi: रद्द करें
ja: キャンセル

source: Save
ar: حفظ
fr: Enregistrer
hi: सहेजें
ja: 保存

source: Close
ar: إغلاق
fr: Fermer
hi: बंद करें
ja: 閉じる

source: Import
ar: استيراد
fr: Importer
hi: आयात
ja: インポート

source: Export
ar: تصدير
fr: Exporter
hi: निर्यात
ja: エクスポート

source: Project Name
ar: اسم المشروع
fr: Nom du projet
hi: प्रोजेक्ट का नाम
ja: プロジェクト名

source: Description
ar: الوصف
hi: विवरण
ja: 説明

source: Tags
ar: الوسوم
fr: Étiquettes
hi: टैग
ja: タグ

# projectSaved
source: Project saved successfully
ar: تم حفظ المشروع بنجاح
fr: Projet enregistré avec succès
hi: प्रोजेक्ट सफलतापूर्वक सहेजा गया
ja: プロジェクトが正常に保存されました

source: Error
ar: خطأ
fr: Erreur
hi: त्रुटि
ja: エラー

source: Success
ar: نجاح
fr: Succès
hi: सफलता
ja: 成功

source: Delete
ar: حذف
fr: Supprimer
hi: हटाएं
ja: 削除

source: Restore
ar: استعادة
fr: Restaurer
hi: पुनर्स्थापित करें
ja: 復元

# confirmClearWorkspace
source: Clear Workspace?
ar: مسح مساحة العمل؟
fr: Effacer l'espace de travail ?
hi: कार्यक्षेत्र साफ़ करें?
ja: ワークスペースをクリアしますか？

# confirmClearWorkspaceContent
source: This will remove all elements. This action cannot be undone.
ar: سيتم حذف جميع العناصر. لا يمكن التراجع عن هذا الإجراء.
fr: Cela supprimera tous les éléments. Cette action est irréversible.
hi: यह सभी तत्वों को हटा देगा। यह क्रिया पूर्ववत नहीं की जा सकती।
ja: これによりすべての要素が削除されます。この操作は取り消せません。

# pickProjectFolder
source: Select Folder
ar: اختر المجلد
fr: Choisir un dossier
hi: फ़ोल्डर चुनें
ja: フォルダを選択

# repoUrl
source: Repository URL
ar: رابط المستودع
fr: URL du dépôt
hi: रिपॉजिटरी URL
ja: リポジトリURL

# scanAndGenerate
source: Analyze & Generate
ar: تحليل وتوليد
fr: Analyser et générer
hi: विश्लेषण और उत्पन्न करें
ja: 分析して生成

source: Gemini API Key
ar: مفتاح Gemini API
fr: Clé API Gemini
hi: Gemini API कुंजी
ja: Gemini APIキー

source: GitHub Token
ar: رمز جيت هاب
fr: Jeton GitHub
hi: GitHub टोकन
ja: GitHubトークン

# getApiKey
source: Get API key from Google
ar: احصل على المفتاح من جوجل
fr: Obtenir une clé API de Google
hi: Google से कुंजी प्राप्त करें
ja: GoogleからAPIキーを取得

# generateToken
source: Generate GitHub Token
ar: توليد رمز جيت هاب
fr: Générer un jeton GitHub
hi: GitHub टोकन उत्पन्न करें
ja: GitHubトークンを生成

source: Elements
ar: عناصر
fr: Éléments
hi: तत्व
ja: 要素

source: Words
ar: كلمات
fr: Mots
hi: शब्द
ja: 単語

# healthy
source: Optimal
ar: مثالي
hi: इष्टतम
ja: 最適

# errors
source: Critical Issues
ar: أخطاء حرجة
fr: Problèmes critiques
hi: गंभीर समस्याएं
ja: 重大な問題

# warnings
source: Improvements
ar: تحسينات مقترحة
fr: Améliorations
hi: सुधार
ja: 改善点

source: Focus Mode
ar: وضع التركيز
fr: Mode focus
hi: फोकस मोड
ja: フォーカスモード

# autoSaved
source: Changes Saved
ar: تم حفظ التغييرات
fr: Modifications enregistrées
hi: परिवर्तन सहेजे गए
ja: 変更が保存されました

source: Project Settings
ar: إعدادات المشروع
fr: Paramètres du projet
hi: प्रोजेक्ट सेटिंग्स
ja: プロジェクト設定

source: Variables
ar: المتغيرات
hi: चर
ja: 変数

source: License
ar: الرخصة
fr: Licence
hi: लाइसेंस
ja: ライセンス

source: Contributing
ar: المساهمة
fr: Contribution
hi: योगदान
ja: 貢献

# colors
source: Branding Colors
ar: ألوان الهوية
fr: Couleurs de marque
hi: ब्रांडिंग रंग
ja: ブランディングカラー

source: Formatting
ar: التنسيق
fr: Formatage
hi: फ़ॉर्मेटिंग
ja: フォーマット

source: Primary Color
ar: اللون الأساسي
fr: Couleur primaire
hi: प्राथमिक रंग
ja: メインカラー

source: Secondary Color
ar: اللون الثانوي
fr: Couleur secondaire
hi: द्वितीयक रंग
ja: サブカラー

source: Export HTML
ar: تصدير HTML
fr: Exporter en HTML
hi: HTML निर्यात करें
ja: HTMLをエクスポート

# listBulletStyle
source: Bullet Style
ar: نمط القائمة
fr: Style de puce
hi: बुलेट शैली
ja: 箇条書きスタイル

source: Section Spacing
ar: تباعد الأقسام
fr: Espacement des sections
hi: अनुभाग रिक्ति
ja: セクション間隔

source: Templates
ar: القوالب
fr: Modèles
hi: टेम्पलेट्स
ja: テンプレート

source: Load
ar: تحميل
fr: Charger
hi: लोड करें
ja: 読み込む

# viewOnGithub
source: GitHub
ar: جيت هاب

source: Version
ar: الإصدار
hi: संस्करण
ja: バージョン

# rightsReserved
source: All rights reserved.
ar: جميع الحقوق محفوظة.
fr: Tous droits réservés.
hi: सर्वाधिकार सुरक्षित।

source: System Default
ar: تلقائي النظام
fr: Par défaut du système
hi: सिस्टम डिफ़ॉल्ट
ja: システムデフォルト

# settingsSaved
source: Settings updated!
ar: تم تحديث الإعدادات!
fr: Paramètres mis à jour !
hi: सेटिंग्स अपडेट की गईं!
ja: 設定が更新されました！

# commonShortcuts
source: General Shortcuts
ar: اختصارات عامة
fr: Raccourcis généraux
hi: सामान्य शॉर्टकट
ja: 全般ショートカット

# elementShortcuts
source: Editor Shortcuts
ar: اختصارات المحرر
fr: Raccourcis éditeur
hi: संपादक शॉर्टकट
ja: エディタショートカット

source: New Project
ar: مشروع جديد
fr: Nouveau projet
hi: नया प्रोजेक्ट
ja: 新規プロジェクト

source: Open Project
ar: فتح مشروع
fr: Ouvrir un projet
hi: प्रोजेक्ट खोलें
ja: プロジェクトを開く

source: Save Project
ar: حفظ المشروع
fr: Enregistrer le projet
hi: प्रोजेक्ट सहेजें
ja: プロジェクトを保存

source: Export Project
ar: تصدير المشروع
fr: Exporter le projet
hi: प्रोजेक्ट निर्यात करें
ja: プロジェクトをエクスポート

# print
source: Print PDF
ar: طباعة PDF
fr: Imprimer en PDF
hi: PDF प्रिंट करें
ja: PDF印刷

source: Undo
ar: تراجع
fr: Annuler
hi: पूर्ववत करें
ja: 元に戻す

source: Redo
ar: إعادة
fr: Rétablir
hi: फिर से करें
ja: やり直し

# showPreview
source: Live Preview
ar: المعاينة الحية
fr: Aperçu en direct
hi: लाइव पूर्वावलोकन
ja: ライブプレビュー

source: Toggle Grid
ar: تبديل الشبكة
fr: Afficher la grille
hi: ग्रिड टॉगल करें
ja: グリッド切替

# toggleTheme
source: Appearance
ar: المظهر
fr: Apparence
hi: उपस्थिति
ja: 外観

# openSettings
source: Preferences
ar: التفضيلات
fr: Préférences
hi: प्राथमिकताएं
ja: 設定

# help
source: Support
ar: الدعم والمساعدة
fr: Aide
hi: सहायता
ja: サポート

source: Add Heading
ar: إضافة عنوان
fr: Ajouter un titre
hi: शीर्षक जोड़ें
ja: 見出しを追加

source: Add Subheading
ar: عنوان فرعي
fr: Ajouter un sous-titre
hi: उपशीर्षक जोड़ें
ja: 副見出しを追加

source: Add Paragraph
ar: إضافة فقرة
fr: Ajouter un paragraphe
hi: पैराग्राफ जोड़ें
ja: 段落を追加

source: Add Image
ar: إضافة صورة
fr: Ajouter une image
hi: छवि जोड़ें
ja: 画像を追加

source: Add Table
ar: إضافة جدول
fr: Ajouter un tableau
hi: तालिका जोड़ें
ja: 表を追加

source: Add List
ar: إضافة قائمة
fr: Ajouter une liste
hi: सूची जोड़ें
ja: リストを追加

source: Add Quote
ar: إضافة اقتباس
fr: Ajouter une citation
hi: उद्धरण जोड़ें
ja: 引用を追加

source: Add Link
ar: إضافة رابط
fr: Ajouter un lien
hi: लिंक जोड़ें
ja: リンクを追加

# aboutDescription
source: The ultimate SaaS suite for professional Markdown documentation. Built for speed, precision, and efficiency.
ar: جناح SaaS المتكامل لإنشاء توثيق مارك داون احترافي لمشاريعك. سرعة، دقة، وكفاءة.
fr: La suite SaaS ultime pour la documentation Markdown professionnelle. Conçue pour la vitesse et la précision.
hi: पेशेवर Markdown प्रलेखन के लिए अंतिम SaaS सुइट। गति और सटीकता के लिए निर्मित।
ja: プロフェッショナルなMarkdownドキュメント作成のための究極のSaaSスイート。スピードと精度のために構築されました。

# enterGeminiKey
source: Enter Gemini API Key to unlock AI features.
ar: أدخل مفتاح Gemini لتفعيل ميزات الذكاء الاصطناعي.
fr: Entrez la clé API Gemini pour débloquer les fonctionnalités IA.
hi: AI सुविधाओं को अनलॉक करने के लिए Gemini API कुंजी दर्ज करें।
ja: AI機能を有効にするにはGemini APIキーを入力してください。

# githubIntegration
source: GitHub Sync
ar: مزامنة جيت هاب
fr: Synchro GitHub
hi: GitHub सिंक
ja: GitHub同期

# enterGithubToken
source: Optional: GitHub Token for enhanced repository scanning.
ar: اختياري: رمز جيت هاب لتحسين سرعة المسح.
fr: Optionnel : jeton GitHub pour un scan amélioré du dépôt.
hi: वैकल्पिक: उन्नत रिपॉजिटरी स्कैनिंग के लिए GitHub टोकन।
ja: オプション: リポジトリスキャンを強化するためのGitHubトークン。

# localFolder
source: Local Directory
ar: مجلد محلي
fr: Répertoire local
hi: स्थानीय निर्देशिका
ja: ローカルディレクトリ

# githubRepo
source: GitHub Repository
ar: مستودع جيت هاب
fr: Dépôt GitHub
hi: GitHub रिपॉजिटरी
ja: GitHubリポジトリ

# scanLocalFolder
source: Scan a folder to build documentation.
ar: امسح مجلداً لبناء التوثيق.
fr: Scanner un dossier pour créer la documentation.
hi: दस्तावेज़ बनाने के लिए एक फ़ोल्डर स्कैन करें।
ja: フォルダをスキャンしてドキュメントを作成します。

# scanGithubRepo
source: Generate docs from a public GitHub repo.
ar: توليد توثيق من مستودع جيت هاب عام.
fr: Générer la doc depuis un dépôt GitHub public.
hi: सार्वजनिक GitHub रेपो से दस्तावेज़ उत्पन्न करें।
ja: 公開GitHubリポジトリからドキュメントを生成します。

# fetchingRepo
source: Syncing repository...
ar: جاري المزامنة مع المستودع...
fr: Synchronisation du dépôt...
hi: रिपॉजिटरी सिंक हो रही है...
ja: リポジトリを同期中...

# analyzingAI
source: AI Engine Analyzing...
ar: محرك الذكاء الاصطناعي يحلل...
fr: Analyse du moteur IA...
hi: AI इंजन विश्लेषण कर रहा है...
ja: AIエンジンが分析中...

# readmeGenerated
source: README crafted successfully!
ar: تم إنشاء README بنجاح!
fr: README créé avec succès !
hi: README सफलतापूर्वक तैयार किया गया!
ja: READMEが正常に作成されました！

# projectImported
source: Import successful
ar: تم الاستيراد بنجاح
fr: Importation réussie
hi: आयात सफल
ja: インポート成功

# contentFetched
source: Content ready for review.
ar: المحتوى جاهز للمراجعة.
fr: Contenu prêt pour révision.
hi: सामग्री समीक्षा के लिए तैयार है।
ja: コンテンツの確認準備ができました。

# fetchFailed
source: Sync Failed
ar: فشلت المزامنة
fr: Échec de la synchro
hi: सिंक विफल
ja: 同期失敗

# generateExtraFiles
source: Extra Project Files
ar: ملفات المشروع الإضافية
fr: Fichiers projet supp.
hi: अतिरिक्त प्रोजेक्ट फ़ाइलें
ja: 追加プロジェクトファイル

# publishToGithub
source: Push to GitHub
ar: النشر إلى جيت هاب
fr: Publier sur GitHub
hi: GitHub पर पुश करें
ja: GitHubにプッシュ

# contributionGuidelinesBuilder
source: Community Builder
ar: بناء مجتمع المشروع
fr: Bâtisseur de communauté
hi: समुदाय निर्माता
ja: コミュニティビルダー

# contributionGuidelinesDesc
source: Standard open-source guidelines.
ar: إرشادات المصادر المفتوحة القياسية.
fr: Directives open-source standard.
hi: मानक ओपन-सोर्स दिशानिर्देश।
ja: 標準的なオープンソースガイドライン。

# contributingMdDesc
source: Contribution workflow guide.
ar: دليل سير عمل المساهمات.
fr: Guide du flux de travail de contribution.
hi: योगदान कार्यप्रवाह मार्गदर्शिका।
ja: 貢献ワークフローガイド。

source: Generate
ar: توليد
fr: Générer
hi: उत्पन्न करें
ja: 生成

# codeOfConductDesc
source: Code of Conduct policy.
ar: سياسة ميثاق السلوك للمساهمين.
fr: Politique du code de conduite.
hi: आचार संहिता नीति।
ja: 行動規範ポリシー。

# githubTokenMissing
source: GitHub Token required.
ar: رمز جيت هاب مفقود.
fr: Jeton GitHub requis.
hi: GitHub टोकन आवश्यक है।
ja: GitHubトークンが必要です。

source: Owner
ar: المالك
fr: Propriétaire
hi: मालिक
ja: オーナー

source: Repo Name
ar: اسم المستودع
fr: Nom du dépôt
hi: रेपो नाम
ja: リポジトリ名

source: Branch Name
ar: اسم الفرع
fr: Nom de la branche
hi: शाखा का नाम
ja: ブランチ名

# commitMessage
source: Message
ar: رسالة الحفظ
hi: संदेश
ja: メッセージ

# publishDialogDesc
source: Create a new branch and PR instantly.
ar: إنشاء فرع جديد وطلب سحب (PR) فوراً.
fr: Créer une nouvelle branche et une PR instantanément.
hi: तुरंत एक नई शाखा और PR बनाएं।
ja: 新しいブランチとPRを即座に作成します。

# ownerRepoRequired
source: Identity required
ar: الهوية مطلوبة
fr: Identité requise
hi: पहचान आवश्यक है
ja: IDが必要です

# prCreated
source: Pull Request Sent!
ar: تم إرسال طلب السحب بنجاح!
fr: Demande de tirage envoyée !
hi: पुल अनुरोध भेज दिया गया!
ja: プルリクエストを送信しました！

# viewPrs
source: Open PRs
ar: عرض الطلبات
fr: Voir les PR
hi: PRs देखें
ja: PRを表示

# copiedToClipboard
source: Copied!
ar: تم النسخ!
fr: Copié !
hi: कॉपी किया गया!
ja: コピーしました！

source: Download
ar: تحميل
fr: Télécharger
hi: डाउनलोड
ja: ダウンロード

source: Copy
ar: نسخ
fr: Copier
hi: कॉपी
ja: コピー

source: PRO ACTIVE
ar: عضوية PRO مفعلة
fr: PRO ACTIF
hi: PRO सक्रिय
ja: PRO 有効

source: FREE PLAN
ar: الخطة المجانية
fr: PLAN GRATUIT
hi: मुफ्त योजना
ja: フリープラン

source: Upgrade to Pro
ar: الترقية إلى PRO
fr: Passer à Pro
hi: प्रो में अपग्रेड करें
ja: Proにアップグレード

# becomeSponsor
source: Become a Sponsor
ar: كن داعماً للمشروع
fr: Devenir sponsor
hi: प्रायोजक बनें
ja: スポンサーになる

source: Claim Reward
ar: المطالبة بالمكافأة
fr: Réclamer récompense
hi: पुरस्कार का दावा करें
ja: 特典を受け取る

# supportAndFeedback
source: Support & Feedback
ar: الدعم والملاحظات
fr: Aide & Feedback
hi: सहायता और प्रतिक्रिया
ja: サポートとフィードバック

source: Admin Dashboard
ar: لوحة التحكم
fr: Tableau de bord admin
hi: एडमिन डैशबोर्ड
ja: 管理者ダッシュボード

source: Total Users
ar: إجمالي المستخدمين
fr: Total utilisateurs
hi: कुल उपयोगकर्ता
ja: 総ユーザー数

source: Pro Members
ar: أعضاء PRO
fr: Membres Pro
hi: प्रो सदस्य
ja: Proメンバー

# feedbackTitle
source: User Feedback
ar: آراء المستخدمين
fr: Feedback utilisateur
hi: उपयोगकर्ता प्रतिक्रिया
ja: ユーザーフィードバック

source: View Attachment
ar: عرض المرفق
fr: Voir la pièce jointe
hi: अनुलग्नक देखें
ja: 添付ファイルを表示

# dragAndDropHint
source: Drag & Drop files here
ar: اسحب وأفلت الملفات هنا
fr: Glissez-déposez les fichiers ici
hi: फ़ाइलें यहाँ खींचें और छोड़ें
ja: ここにファイルをドラッグ＆ドロップ

# ctrlPasteHint
source: Ctrl+V to paste image
ar: Ctrl+V للصق صورة من الحافظة
fr: Ctrl+V pour coller une image
hi: छवि पेस्ट करने के लिए Ctrl+V
ja: Ctrl+Vで画像を貼り付け

source: Projects Library
ar: مكتبة المشاريع
fr: Bibliothèque de projets
hi: प्रोजेक्ट लाइब्रेरी
ja: プロジェクトライブラリ

source: Doc Quality
ar: جودة التوثيق
fr: Qualité de la doc
hi: दस्तावेज़ गुणवत्ता
ja: ドキュメント品質

source: Synced
ar: تمت المزامنة
fr: Synchronisé
hi: सिंक किया गया
ja: 同期済み

source: Load Template?
ar: تحميل القالب؟
fr: Charger le modèle ?
hi: टेम्पलेट लोड करें?
ja: テンプレートを読み込みますか？

# replaceWorkspace
source: This will replace your current workspace.
ar: سيؤدي هذا إلى استبدال مساحة العمل الحالية.
fr: Cela remplacera votre espace de travail actuel.
hi: यह आपके वर्तमान कार्यक्षेत्र को बदल देगा।
ja: 現在のワークスペースが上書きされます。

source: Funding Generator
ar: مولد الدعم المادي
fr: Générateur de financement
hi: फंडिंग जनरेटर
ja: 資金調達ジェネレーター

source: Showcase Gallery
ar: معرض النماذج
fr: Galerie d'exposition
hi: शोकेस गैलरी
ja: ショーケースギャラリー

# projectAndFiles
source: Project & Files
ar: المشروع والملفات
fr: Projet & Fichiers
hi: प्रोजेक्ट और फ़ाइलें
ja: プロジェクトとファイル

# toolsAndGenerators
source: Tools & Generators
ar: الأدوات والمولدات
fr: Outils & Générateurs
hi: उपकरण और जनरेटर
ja: ツールとジェネレーター

source: Intelligence
ar: الذكاء الاصطناعي
hi: इंटेलिजेंस
ja: インテリジェンス

source: Application
ar: التطبيق
hi: एप्लिकेशन
ja: アプリケーション

source: Sign In & Sync
ar: تسجيل الدخول والمزامنة
fr: Se connecter & Synchro
hi: साइन इन और सिंक
ja: サインインして同期

source: Account
ar: الحساب
fr: Compte
hi: खाता
ja: アカウント

source: Community
ar: المجتمع
fr: Communauté
hi: समुदाय
ja: コミュニティ

source: Branding
ar: الهوية البصرية
hi: ब्रांडिंग
ja: ブランディング

source: Select License
ar: اختر الرخصة
fr: Sélectionner la licence
hi: लाइसेंस चुनें
ja: ライセンスを選択

# licenseInfo
source: A LICENSE file will be generated and included in the export.
ar: سيتم إنشاء ملف LICENSE وتضمينه في التصدير.
fr: Un fichier LICENSE sera généré et inclus dans l'exportation.
hi: एक LICENSE फ़ाइल उत्पन्न की जाएगी और निर्यात में शामिल की जाएगी।
ja: LICENSEファイルが生成され、エクスポートに含まれます。

source: Community Standards
ar: معايير المجتمع
fr: Normes de la communauté
hi: सामुदायिक मानक
ja: コミュニティ標準

# contributingDesc
source: Adds a standard contributing guide.
ar: يضيف دليل مساهمة قياسي.
fr: Ajoute un guide de contribution standard.
hi: एक मानक योगदान मार्गदर्शिका जोड़ता है।
ja: 標準的な貢献ガイドを追加します。

source: Security Policy
ar: سياسة الأمان
fr: Politique de sécurité
hi: सुरक्षा नीति
ja: セキュリティポリシー

# securityDesc
source: Adds a security policy.
ar: يضيف ملف سياسة الأمان.
fr: Ajoute une politique de sécurité.
hi: एक सुरक्षा नीति जोड़ता है।
ja: セキュリティポリシーを追加します。

source: Support Info
ar: معلومات الدعم
fr: Info Support
hi: सहायता जानकारी
ja: サポート情報

# supportDesc
source: Adds support information.
ar: يضيف معلومات حول كيفية الحصول على الدعم.
fr: Ajoute des informations sur le support.
hi: सहायता जानकारी जोड़ता है।
ja: サポート情報を追加します。

# cocDesc
source: Adds a code of conduct.
ar: يضيف ميثاق السلوك للمشروع.
fr: Ajoute un code de conduite.
hi: आचार संहिता जोड़ता है।
ja: 行動規範を追加します。

source: Issue Templates
ar: نماذج البلاغات
fr: Modèles d'issues
hi: इश्यू टेम्पलेट्स
ja: イシューテンプレート

# issueTemplatesDesc
source: Adds GitHub issue and PR templates.
ar: يضيف نماذج لبلاغات الأخطاء وطلبات السحب.
fr: Ajoute des modèles d'issues et de PR GitHub.
hi: GitHub इश्यू और PR टेम्पलेट्स जोड़ता है।
ja: GitHubのイシューとPRのテンプレートを追加します。

# includeHtml
source: Include a formatted HTML file.
ar: تضمين ملف HTML منسق.
fr: Inclure un fichier HTML formaté.
hi: एक स्वरूपित HTML फ़ाइल शामिल करें।
ja: フォーマットされたHTMLファイルを含める。

source: Markdown Style
ar: نمط المارك داون
fr: Style Markdown
hi: Markdown शैली
ja: Markdownスタイル

source: Pick Color
ar: اختر اللون
fr: Choisir couleur
hi: रंग चुनें
ja: 色を選択

source: Typography
ar: النصوص والخطوط
fr: Typographie
hi: टाइपोग्राफी
ja: タイポグラフィ

# mediaAndGraphics
source: Media & Graphics
ar: الوسائط والجرافيك
fr: Médias & Graphiques
hi: मीडिया और ग्राफिक्स
ja: メディアとグラフィックス

source: Structure
ar: الهيكل والتنظيم
hi: संरचना
ja: 構造

source: Snippets
ar: القصاصات الجاهزة
hi: स्निपेट्स
ja: スニペット

# searchHint
source: Search...
ar: بحث...
fr: Rechercher...
hi: खोजें...
ja: 検索...

source: Save Selected
ar: حفظ المحدد
fr: Enregistrer sélection
hi: चयनित सहेजें
ja: 選択範囲を保存

# noSnippets
source: No snippets found
ar: لا توجد قصاصات محفوظة
fr: Aucun snippet trouvé
hi: कोई स्निपेट नहीं मिला
ja: スニペットが見つかりません

source: Save Snippet
ar: حفظ قصاصة
fr: Enregistrer snippet
hi: स्निपेट सहेजें
ja: スニペットを保存

source: Snippet Name
ar: اسم القصاصة
fr: Nom du snippet
hi: स्निपेट का नाम
ja: スニペット名

# snippetSaved
source: Snippet saved successfully!
ar: تم حفظ القصاصة بنجاح!
fr: Snippet enregistré avec succès !
hi: स्निपेट सफलतापूर्वक सहेजा गया!
ja: スニペットが正常に保存されました！

source: Heading
ar: عنوان
fr: Titre
hi: शीर्षक
ja: 見出し

source: Paragraph
ar: فقرة
fr: Paragraphe
hi: पैराग्राफ
ja: 段落

source: Quote
ar: اقتباس
fr: Citation
hi: उद्धरण
ja: 引用

source: Code
ar: كود برمي
hi: कोड
ja: コード

source: Image
ar: صورة
hi: छवि
ja: 画像

source: Icon
ar: أيقونة
fr: Icône
hi: आइकन
ja: アイコン

source: Button
ar: زر رابط
fr: Bouton
hi: बटन
ja: ボタン

source: Badge
ar: شارة
hi: बैज
ja: バッジ

source: Socials
ar: تواصل
fr: Sociaux
hi: सोशल
ja: ソーシャル

source: Stats
ar: إحصائيات
hi: आँकड़े
ja: 統計

source: People
ar: أشخاص
fr: Gens
hi: लोग
ja: 人

source: Widget
ar: ودجت
hi: विजेट
ja: ウィジェット

source: List
ar: المنظمة
fr: Liste
hi: सूची
ja: リスト

source: Table
ar: جدول
fr: Tableau
hi: तालिका
ja: 表

source: Divider
ar: فاصل
fr: Diviseur
hi: विभाजक
ja: 区切り線

source: Foldout
ar: قائمة منسدلة
fr: Déroulant
hi: फ़ोल्डआउट
ja: 折りたたみ

source: Design Showcase
ar: معرض التصاميم
fr: Galerie de Design
hi: डिज़ाइन शोकेस
ja: デザインショーケース

source: Explore Templates
ar: استكشف القوالب
fr: Explorer les Modèles
hi: टेम्पलेट्स खोजें
ja: テンプレートを探索

# jumpstartDoc
source: Jumpstart your documentation with professional layouts.
ar: ابدأ توثيقك بسرعة مع تصاميم احترافية.
fr: Lancez votre documentation avec des mises en page professionnelles.
hi: पेशेवर लेआउट के साथ अपने दस्तावेज़ीकरण की शुरुआत करें।
ja: プロフェッショナルなレイアウトでドキュメントをすぐに開始できます。

source: CLOUD
ar: سحابي
hi: क्लाउड
ja: クラウド

source: Use This Template
ar: استخدم هذا القالب
fr: Utiliser ce Modèle
hi: इस टेम्पलेट का उपयोग करें
ja: このテンプレートを使用

# applyTemplate
source: Apply {name}?
ar: تطبيق {name}؟
fr: Appliquer {name}?
hi: {name} लागू करें?
ja: {name} を適用しますか？

source: Template Applied!
ar: تم تطبيق القالب بنجاح!
fr: Modèle Appliqué!
hi: टेम्पलेट लागू किया गया!
ja: テンプレートが適用されました！

source: Proceed?
ar: هل تود المتابعة؟
fr: Continuer?
hi: आगे बढ़ें?
ja: 続行しますか？

# replaceCurrentWorkspace
source: This will replace your current workspace elements. Proceed?
ar: سيؤدي هذا إلى استبدال جميع العناصر في مساحة العمل الحالية. هل تود المتابعة؟
fr: Cela remplacera les éléments de votre espace de travail actuel. Continuer?
hi: यह आपके वर्तमान कार्यक्षेत्र तत्वों को बदल देगा। आगे बढ़ें?
ja: 現在のワークスペース要素が上書きされます。続行しますか？

# selectElementToPreview
source: Select an element to preview code
ar: اختر عنصراً لمعاينة الكود
fr: Sélectionnez un élément pour prévisualiser le code
hi: कोड पूर्वावलोकन के लिए एक तत्व चुनें
ja: コードをプレビューする要素を選択してください

# githubIntegrationInactive
source: GitHub integration inactive. Login to enable auto-import.
ar: مزامنة جيت هاب غير نشطة. سجل الدخول لتفعيل الاستيراد التلقائي.
fr: Intégration GitHub inactive. Connectez-vous pour activer l'importation auto.
hi: GitHub एकीकरण निष्क्रिय है। ऑटो-इंपोर्ट सक्षम करने के लिए लॉगिन करें।
ja: GitHub連携が無効です。自動インポートを有効にするにはログインしてください。

source: Login
ar: تسجيل الدخول
fr: Connexion
hi: लॉगिन
ja: ログイン

# startMasterpiece
source: Start Your Masterpiece
ar: ابدأ ابداعك الآن
fr: Commencez Votre Chef-d'œuvre
hi: अपनी उत्कृष्ट कृति शुरू करें
ja: 傑作を作り始めましょう

# dragComponentsHint
source: Drag components from the library to build your documentation
ar: اسحب المكونات من المكتبة لبناء التوثيق الخاص بك
fr: Faites glisser des composants de la bibliothèque pour construire votre documentation
hi: दस्तावेज़ बनाने के लिए लाइब्रेरी से घटकों को खींचें
ja: ライブラリからコンポーネントをドラッグしてドキュメントを作成します

source: Compact
ar: مضغوط
hi: कॉम्पैक्ट
ja: コンパクト

source: Standard
ar: قياسي
hi: मानक
ja: 標準

source: Spacious
ar: واسع
fr: Spacieux
hi: विस्तृत
ja: ゆったり

source: Project Intelligence Import
ar: استيراد ذكاء المشروع
fr: Importation d'Intelligence de Projet
hi: प्रोजेक्ट इंटेलिजेंस आयात
ja: プロジェクト・インテリジェンス・インポート

source: Connect Now
ar: اتصل الآن
fr: Se Connecter Maintenant
hi: अभी कनेक्ट करें
ja: 今すぐ接続

# limitedAccessGitHub
source: Limited access. Connect GitHub for seamless project engineering
ar: وصول محدود. اتصل بجيت هاب لهندسة مشاريع سلسة
fr: Accès limité. Connectez GitHub pour une ingénierie de projet fluide
hi: सीमित पहुंच। निर्बाध प्रोजेक्ट इंजीनियरिंग के लिए GitHub कनेक्ट करें
ja: アクセス制限あり。シームレスなプロジェクト・エンジニアリングのためにGitHubを接続してください

source: Manual / File
ar: يدوي / ملف
fr: Manuel / Fichier
hi: मैनुअल / फ़ाइल
ja: 手動 / ファイル

source: Project Context #
ar: سياق المشروع #
fr: Contexte du Projet #
hi: प्रोजेक्ट संदर्भ #
ja: プロジェクトの文脈 #

# writingPasteHint
source: ... Starting writing or paste here
ar: ... ابدأ الكتابة أو الصق هنا
fr: ... Commencez à écrire ou collez ici
hi: ... यहाँ लिखना शुरू करें या पेस्ट करें
ja: ... ここに書くか貼り付けてください

source: Finalize Import
ar: إنهاء الاستيراد
fr: Finaliser l'Importation
hi: आयात पूरा करें
ja: インポートを完了

source: Content Settings
ar: إعدادات المحتوى
fr: Paramètres du Contenu
hi: सामग्री सेटिंग्स
ja: コンテンツ設定
