Repository: mhmdwaelanwr/Markdown-Creator
Catalog: lib/l10n/app_*.arb
Languages: ar, fr, hi, ja

source: Card Description
ar: وصف البطاقة
fr: Description de la Carte
hi: कार्ड विवरण
ja: カードの説明

# awesomeProjectDesc
source: Awesome project description goes here
ar: وصف المشروع الرائع يوضع هنا
fr: La description géniale du projet va ici
hi: शानदार प्रोजेक्ट विवरण यहाँ आता है
ja: 素晴らしいプロジェクトの説明がここに入ります

source: Design Settings
ar: إعدادات التصميم
fr: Paramètres de Design
hi: डिज़ाइन सेटिंग्स
ja: デザイン設定

source: Upload
ar: رفع
fr: Télécharger
hi: अपलोड
ja: アップロード

source: Project Logo
ar: شعار المشروع
fr: Logo du Projet
hi: प्रोजेक्ट लोगो
ja: プロジェクトロゴ

source: Use Gradient Background
ar: استخدام خلفية متدرجة
fr: Utiliser un Fond Dégradé
hi: ग्रेडिएंट बैकग्राउंड का उपयोग करें
ja: グラデーション背景を使用

source: Background Color
ar: لون الخلفية
fr: Couleur de Fond
hi: पृष्ठभूमि का रंग
ja: 背景色

source: Text Color
ar: لون النص
fr: Couleur du Texte
hi: टेक्स्ट का रंग
ja: 文字色

source: Typography Settings
ar: إعدادات الخطوط
fr: Paramètres de Typographie
hi: टाइपोग्राफी सेटिंग्स
ja: タイポグラフィ設定

source: Font Family
ar: عائلة الخط
fr: Famille de Polices
hi: फ़ॉन्ट परिवार
ja: フォントファミリー

source: Title Font Size
ar: حجم خط العنوان
fr: Taille de Police du Titre
hi: शीर्षक फ़ॉन्ट आकार
ja: タイトルフォントサイズ

# fundingGeneratorTitle
source: Funding Generator (FUNDING.yml)
ar: مولد الدعم (FUNDING.yml)
fr: Générateur de Financement (FUNDING.yml)
hi: फंडिंग जनरेटर (FUNDING.yml)
ja: 資金調達ジェネレーター (FUNDING.yml)

source: Sponsorships
ar: الرعايات
fr: Sponsorisations
hi: प्रायोजन
ja: スポンサーシップ

# sponsorshipsDesc
source: Sponsorships help your community know how to financially support this repository. This generates a FUNDING.yml file for your .github folder
ar: تساعد الرعايات مجتمعك على معرفة كيفية دعم هذا المستودع مالياً. هذا يولد ملف FUNDING.yml لمجلد .github الخاص بك
fr: Les sponsorisations aident votre communauté à savoir comment soutenir financièrement ce dépôt. Cela génère un fichier FUNDING.yml pour votre dossier .github
hi: प्रायोजन आपके समुदाय को यह जानने में मदद करते हैं कि इस रिपॉजिटरी का आर्थिक रूप से समर्थन कैसे किया जाए। यह आपके .github फ़ोल्डर के लिए एक FUNDING.yml फ़ाइल बनाता है
ja: スポンサーシップは、コミュニティがこのリポジトリを経済的に支援する方法を知るのに役立ちます。これにより、.githubフォルダ用のFUNDING.ymlファイルが生成されます

source: Supported Platforms
ar: المنصات المدعومة
fr: Plateformes Supportées
hi: समर्थित प्लेटफॉर्म
ja: サポートされているプラットフォーム

source: GitHub Username(s)
ar: اسم مستخدم جيت هاب
fr: Nom(s) d'utilisateur GitHub
hi: GitHub उपयोगकर्ता नाम
ja: GitHubユーザー名

source: Patreon Username
ar: اسم مستخدم باتريون
fr: Nom d'utilisateur Patreon
hi: Patreon उपयोगकर्ता नाम
ja: Patreonユーザー名

source: Ko-fi Username
ar: اسم مستخدم Ko-fi
fr: Nom d'utilisateur Ko-fi
hi: Ko-fi उपयोगकर्ता नाम
ja: Ko-fiユーザー名

# extraFilesSelectionDesc
source: Select standard documentation files to generate and download for your project repository.
ar: اختر ملفات التوثيق القياسية لتوليدها وتحميلها لمستودع مشروعك.
fr: Sélectionnez les fichiers de documentation standard à générer et télécharger pour votre dépôt de projet.
hi: अपने प्रोजेक्ट रिपॉजिटरी के लिए उत्पन्न और डाउनलोड करने के लिए मानक दस्तावेज़ फ़ाइलें चुनें।
ja: プロジェクトリポジトリ用に生成およびダウンロードする標準ドキュメントファイルを選択します。

# licenseLegalPermission
source: Legal permission for others to use your code
ar: إذن قانوني للآخرين لاستخدام الكود الخاص بك
fr: Permission légale pour les autres d'utiliser votre code
hi: दूसरों को आपके कोड का उपयोग करने की कानूनी अनुमति
ja: 他者があなたのコードを使用するための法的許可

# contributingGuidelinesHint
source: Guidelines for people who want to contribute
ar: إرشادات للأشخاص الذين يرغبون في المساهمة
fr: Directives pour les personnes qui souhaitent contribuer
hi: योगदान देने के इच्छुक लोगों के लिए दिशा-निर्देश
ja: 貢献したい人のためのガイドライン

# securityInstructionsHint
source: Instructions for reporting vulnerabilities
ar: تعليمات للإبلاغ عن الثغرات الأمنية
fr: Instructions pour signaler les vulnérables
hi: सुरक्षा कमजोरियों की रिपोर्ट करने के निर्देश
ja: 脆弱性の報告手順

# cocPolicyHint
source: Policy for contributor behavior
ar: سياسة سلوك المساهمين
fr: Politique de comportement des contributeurs
hi: योगदानकर्ता व्यवहार के लिए नीति
ja: 貢献者の行動に関するポリシー

# geminiAiDesc
source: Powering your README generation with next-gen intelligence.
ar: دعم توليد الـ README الخاص بك بذكاء الجيل القادم.
fr: Alimentez votre génération de README avec une intelligence de nouvelle génération.
hi: अगली पीढ़ी की बुद्धिमत्ता के साथ अपने README निर्माण को शक्ति दें।
ja: 次世代のインテリジェンスでREADME生成を強化します。

source: API CONFIGURATION
ar: إعدادات الـ API
fr: CONFIGURATION API
hi: API कॉन्फ़िगरेशन
ja: API設定

# apiKeyStorageHint
source: Your API key is stored locally on your device and is only used to communicate with Google Gemini AI services
ar: يتم تخزين مفتاح الـ API الخاص بك محلياً على جهازك ويستخدم فقط للتواصل مع خدمات Google Gemini AI
fr: Votre clé API est stockée localement sur votre appareil et n'est utilisée que pour communiquer avec les services Google Gemini AI
hi: आपकी API कुंजी आपके डिवाइस पर स्थानीय रूप से संग्रहीत है और इसका उपयोग केवल Google Gemini AI सेवाओं के साथ संचार करने के लिए किया जाता है
ja: APIキーはデバイスにローカルに保存され、Google Gemini AIサービスとの通信にのみ使用されます

# analyzeCodeAi
source: Analyze Code (with AI)
ar: تحليل الكود (بالذكاء الاصطناعي)
fr: Analyser le Code (avec l'IA)
hi: कोड विश्लेषण (AI के साथ)
ja: コードを分析 (AIを使用)

# pointToFolderHint
source: Point to your project folder, and our AI will analyze the structure to generate a tailored README
ar: وجهنا إلى مجلد مشروعك، وسيقوم ذكاؤنا الاصطناعي بتحليل الهيكل لتوليد README مخصص
fr: Pointez vers votre dossier de projet, et notre IA analysera la structure pour générer un README personnalisé
hi: अपने प्रोजेक्ट फ़ोल्डर की ओर इशारा करें, और हमारा AI एक अनुरूप README उत्पन्न करने के लिए संरचना का विश्लेषण करेगा
ja: プロジェクトフォルダを指定すると、AIが構造を分析して最適なREADMEを生成します

source: Project Path
ar: مسار المشروع
fr: Chemin du Projet
hi: प्रोजेक्ट पथ
ja: プロジェクトパス

# pasteGithubUrlHint
source: Paste a public GitHub URL to automatically fetch and document your repository.
ar: الصق رابط جيت هاب عام لجلب وتوثيق المستودع الخاص بك تلقائياً.
fr: Collez une URL GitHub publique pour récupérer et documenter automatiquement votre dépôt.
hi: अपनी रिपॉजिटरी को स्वचालित रूप से लाने और दस्तावेज़ित करने के लिए एक सार्वजनिक GitHub URL पेस्ट करें।
ja: 公開GitHub URLを貼り付けると、リポジトリを自動的に取得してドキュメント化します。

# githubRepoUrl
source: GitHub Repository URL
ar: رابط مستودع جيت هاب
fr: URL du Dépôt GitHub
hi: GitHub रिपॉजिटरी URL
ja: GitHubリポジトリURL

# fetchAndGenerate
source: Fetch & Generate
ar: جلب وتوليد
fr: Récupérer & Générer
hi: लाएं और उत्पन्न करें
ja: 取得して生成

# publishToGithubDesc
source: This will create a new branch and open a Pull Request with your generated README.md directly on GitHub
ar: سيؤدي هذا إلى إنشاء فرع جديد وفتح طلب سحب (PR) بملف README.md الذي تم إنشاؤه مباشرة على جيت هاب
fr: Cela créera une nouvelle branche et ouvrira une Pull Request avec votre README.md généré directement sur GitHub
hi: यह एक नई शाखा बनाएगा और सीधे GitHub पर आपके उत्पन्न README.md सीधे GitHub पर पोस्ट करेगा
ja: これにより新しいブランチが作成され、生成されたREADME.mdを使用してGitHub上でプルリクエストが直接開かれます

source: AUTHENTICATION
ar: المصادقة
fr: AUTHENTIFICATION
hi: प्रमाणीकरण
ja: 認証

source: Personal Access Token
ar: رمز الوصول الشخصي
fr: Jeton d'Accès Personnel
hi: व्यक्तिगत एक्सेस टोकन
ja: 個人アクセストークン

# needTokenHint
source: Need a token? Generate one in GitHub settings with 'repo' scope
ar: هل تحتاج إلى رمز؟ قم بتوليد واحد في إعدادات جيت هاب بصلاحية 'repo'
fr: Besoin d'un jeton ? Générez-en un dans les paramètres GitHub avec la portée 'repo'
hi: टोकन चाहिए? 'repo' दायरे के साथ GitHub सेटिंग्स में एक उत्पन्न करें
ja: トークンが必要ですか？ 'repo'スコープでGitHub設定から生成してください

source: REPOSITORY DETAILS
ar: تفاصيل المستودع
fr: DÉTAILS DU DÉPÔT
hi: रिपॉजिटरी विवरण
ja: リポジトリの詳細

source: Repository
ar: المستودع
fr: Dépôt
hi: रिपॉजिटरी
ja: リポジトリ

source: New Branch Name
ar: اسم الفرع الجديد
fr: Nouveau Nom de Branche
hi: नया शाखा नाम
ja: 新しいブランチ名

source: Create Pull Request
ar: إنشاء طلب سحب
fr: Créer une Pull Request
hi: पुल अनुरोध बनाएं
ja: プルリクエストを作成

source: Premium Access
ar: الوصول المميز
fr: Accès Premium
hi: प्रीमियम एक्सेस
ja: プレミアムアクセス

source: Pro Status: ACTIVE
ar: حالة برو: مفعلة
fr: Statut Pro : ACTIF
hi: प्रो स्थिति: सक्रिय
ja: Proステータス: 有効

source: Pro Status: INACTIVE
ar: حالة برو: غير مفعلة
fr: Statut Pro : INACTIF
hi: प्रो स्थिति: निष्क्रिय
ja: Proステータス: 無効

# unlimitedAiGeneration
source: Unlimited AI Document Generation
ar: توليد مستندات غير محدود بالذكاء الاصطناعي
fr: Génération de Documents IA Illimitée
hi: असीमित AI दस्तावेज़ निर्माण
ja: 無制限のAIドキュメント生成

# unlockGeminiPower
source: Unlock the full power of Gemini AI
ar: افتح القوة الكاملة لـ Gemini AI
fr: Débloquez toute la puissance de Gemini AI
hi: Gemini AI की पूरी शक्ति को अनलॉक करें
ja: Gemini AIの全機能を解放

source: Pro PDF Exporting
ar: تصدير PDF احترافي
fr: Exportation PDF Pro
hi: प्रो PDF निर्यात
ja: Pro PDFエクスポート

# exportFormattedDocs
source: Export beautifully formatted documents
ar: تصدير مستندات منسقة بشكل جميل
fr: Exportez des documents magnifiquement formatés
hi: खूबसूरती से स्वरूपित दस्तावेज़ निर्यात करें
ja: 美しくフォーマットされたドキュメントをエクスポート

source: Cloud Sync & Library
ar: مزامنة سحابية ومكتبة
fr: Synchro Cloud & Bibliothèque
hi: क्लाउड सिنك और लाइब्रेरी
ja: クラウド同期とライブラリ

# saveProjectsCloud
source: Save your projects to the cloud
ar: احفظ مشاريعك على السحابة
fr: Enregistrez vos projets dans le cloud
hi: अपने प्रोजेक्ट क्लाउड में सहेजें
ja: プロジェクトをクラウドに保存

source: Zero Advertisements
ar: بدون إعلانات
fr: Zéro Publicité
hi: शून्य विज्ञापन
ja: 広告なし

# enjoyFocusedWorkspace
source: Enjoy a clean, focused workspace
ar: استمتع بمساحة عمل نظيفة ومركزة
fr: Profitez d'un espace de travail propre et concentré
hi: एक स्वच्छ, केंद्रित कार्यक्षेत्र का आनंद लें
ja: クリーンで集中できるワークスペース

# donateSupportReward
source: Donate to support development and get Lifetime Pro Access as a reward
ar: تبرع لدعم التطوير واحصل على وصول برو مدى الحياة كمكافأة
fr: Faites un don pour soutenir le développement et obtenez un accès Pro à vie en récompense
hi: विकास का समर्थन करने के लिए दान करें और इनाम के रूप में लाइफटाइम प्रो एक्सेस प्राप्त करें
ja: 開発をサポートするために寄付し、特典としてライフタイムProアクセスを取得してください

source: Maybe Later
ar: ربما لاحقاً
fr: Peut-être Plus Tard
hi: शायद बाद में
ja: また今度

source: Heading Text
ar: نص العنوان
fr: Texte du Titre
hi: शीर्षक टेक्स्ट
ja: 見出しテキスト

source: Level
ar: المستوى
fr: Niveau
hi: स्तर
ja: レベル

source: Text
ar: النص
fr: Texte
hi: टेक्स्ट
ja: テキスト

source: Image URL
ar: رابط الصورة
fr: URL de l'Image
hi: छवि URL
ja: 画像URL

source: Alt Text
ar: النص البديل
fr: Texte Alternatif
hi: वैकल्पिक टेक्स्ट
ja: 代替テキスト

# uploadFile
source: Upload
ar: رفع ملف
fr: Télécharger
hi: अपलोड
ja: アップロード

source: Button Text
ar: نص الزر
fr: Texte du Bouton
hi: बटन टेक्स्ट
ja: ボタンテキスト

source: URL
ar: الرابط

# linkToSection
source: Or link to section
ar: أو رابط لقسم
fr: Ou lien vers la section
hi: या अनुभाग से लिंक करें
ja: またはセクションへのリンク

source: Language
ar: اللغة
fr: Langue
hi: भाषा
ja: 言語

source: Ordered List
ar: قائمة مرتبة
fr: Liste Ordonnée
hi: क्रमबद्ध सूची
ja: 番号付きリスト

source: Add Item
ar: إضافة عنصر
fr: Ajouter un Élément
hi: आइटम जोड़ें
ja: アイテムを追加

# itemN
source: Item {number}
ar: العنصر {number}
fr: Élément {number}
hi: आइटम {number}
ja: アイテム {number}

# searchIcon
source: Search Icon Name
ar: البحث عن اسم الأيقونة
fr: Rechercher le Nom de l'Icône
hi: आइकन नाम खोजें
ja: アイコン名を検索

source: Size
ar: الحجم
fr: Taille
hi: आकार
ja: サイズ

source: Embed Type
ar: نوع التضمين
fr: Type d'Intégration
hi: एम्बेड प्रकार
ja: 埋め込みタイプ

source: Embed URL
ar: رابط التضمين
fr: URL d'Intégration
hi: एम्बेड URL
ja: 埋め込みURL

# repoUserRepo
source: Repo Name (user/repo)
ar: اسم المستودع (المستخدم/المستودع)
fr: Nom du Dépôt (utilisateur/dépôt)
hi: रिपॉजिटरी नाम (उपयोगकर्ता/रिपॉजिटरी)
ja: リポジトリ名 (user/repo)

source: Fetch Info
ar: جلب المعلومات
fr: Récupérer les Infos
hi: जानकारी प्राप्त करें
ja: 情報を取得

source: Show Stars
ar: عرض النجوم
fr: Afficher les Étoiles
hi: सितारे दिखाएं
ja: スターを表示

source: Show Forks
ar: عرض التفرعات
fr: Afficher les Forks
hi: फोर्क्स दिखाएं
ja: フォークを表示

source: Show Issues
ar: عرض البلاغات
fr: Afficher les Issues
hi: समस्याएं दिखाएं
ja: イシューを表示

source: Show License
ar: عرض الرخصة
fr: Afficher la Licence
hi: लाइसेंस दिखाएं
ja: ライセンスを表示

source: Style
ar: النمط
hi: शैली
ja: スタイル

source: Grid (Avatars)
ar: شبكة (صور)
fr: Grille (Avatars)
hi: ग्रिड (अवतार)
ja: グリッド (アバター)

source: List (Names)
ar: قائمة (أسماء)
fr: Liste (Noms)
hi: सूची (नाम)
ja: リスト (名前)

# addColumn
source: Col
ar: عمود
hi: कॉलम
ja: 列を追加

# addRow
source: Row
ar: صف
fr: Ligne
hi: रो
ja: 行を追加

source: Columns & Headers
ar: الأعمدة والعناوين
fr: Colonnes & En-têtes
hi: कॉलम और हेडर
ja: 列とヘッダー

# headerN
source: Header {number}
ar: عنوان {number}
fr: En-tête {number}
hi: हेडर {number}
ja: ヘッダー {number}

source: Rows Data
ar: بيانات الصفوف
fr: Données des Lignes
hi: रो डेटा
ja: 行データ

# rowN
source: Row {number}
ar: الصف {number}
fr: Ligne {number}
hi: रो {number}
ja: 行 {number}

source: Insert Image/Badge
ar: إدراج صورة/شارة
fr: Insérer Image/Badge
hi: छवि/बैज डालें
ja: 画像/バッジを挿入

source: Mermaid Code
ar: كود Mermaid
fr: Code Mermaid
hi: Mermaid कोड
ja: Mermaidコード

# tocAutoDesc
source: This element will automatically generate a table of contents based on headings in your project.
ar: سيقوم هذا العنصر تلقائياً بتوليد جدول محتويات بناءً على العناوين في مشروعك.
fr: Cet élément générera automatiquement une table des matières basée sur les titres de votre projet.
hi: यह तत्व आपके प्रोजेक्ट के शीर्षकों के आधार पर स्वचालित रूप से सामग्री की तालिका उत्पन्न करेगा।
ja: この要素は、プロジェクトの見出しに基づいて目次を自動的に生成します。

source: Raw Markdown / HTML
ar: مارك داون / HTML خام
fr: Markdown / HTML Brut
hi: रॉ Markdown / HTML
ja: 生のMarkdown / HTML

# rawHint
source: Enter any valid Markdown or HTML code here.
ar: أدخل أي كود مارك داون أو HTML صالح هنا.
fr: Entrez ici tout code Markdown ou HTML valide.
hi: यहाँ कोई भी वैध Markdown या HTML कोड दर्ज करें।
ja: 有効なMarkdownまたはHTMLコードを入力してください。

# rawRenderDesc
source: This content will be rendered exactly as written in the final README.
ar: سيتم عرض هذا المحتوى تماماً كما هو مكتوب في ملف README النهائي.
fr: Ce contenu sera rendu exactement tel qu'écrit dans le README final.
hi: यह सामग्री ठीक वैसे ही रेंडर की जाएगी जैसे अंतिम README में लिखी गई है।
ja: このコンテンツは、最終的なREADMEに記述された通りにレンダリングされます。

source: Widget Type
ar: نوع الودجت
fr: Type de Widget
hi: विजेट प्रकार
ja: ウィジェットタイプ

source: Theme (Optional)
ar: المظهر (اختياري)
fr: Thème (Optionnel)
hi: थीम (वैकल्पिक)
ja: テーマ (オプション)

# badgeBuilder
source: Static Badge Builder
ar: باني الشارات الثابتة
fr: Générateur de Badge Statique
hi: स्थिर बैज निर्माता
ja: 静的バッジビルダー

source: Label (Left)
ar: العلامة (يسار)
fr: Étiquette (Gauche)
hi: लेबल (बाएं)
ja: ラベル (左)

source: Message (Right)
ar: الرسالة (يمين)
fr: Message (Droite)
hi: संदेश (दाएं)
ja: メッセージ (右)

source: Color (Right)
ar: اللون (يمين)
fr: Couleur (Droite)
hi: रंग (दाएं)
ja: 色 (右)

source: Logo (Slug)
ar: الشعار (Slug)
hi: लोगो (स्लग)
ja: ロゴ (スラグ)

source: Logo Color
ar: لون الشعار
fr: Couleur du Logo
hi: लोगो रंग
ja: ロゴの色

# labelColor
source: Label Color (Left Background)
ar: لون العلامة (خلفية اليسار)
fr: Couleur de l'Étiquette (Fond Gauche)
hi: लेबल रंग (बायां बैकग्राउंड)
ja: ラベルの色 (左の背景)

# simpleIconsHint
source: Available logos can be found on simpleicons.org. Use the "slug" or name.
ar: يمكن العثور على الشعارات المتاحة في simpleicons.org. استخدم الـ 'slug' أو الاسم.
fr: Les logos disponibles peuvent être trouvés sur simpleicons.org. Utilisez le "slug" ou le nom.
hi: उपलब्ध लोगो simpleicons.org पर मिल सकते हैं। "स्लग" या नाम का उपयोग करें।
ja: 利用可能なロゴはsimpleicons.orgで見つかります。 "スラグ"または名前を使用してください。

source: Open in Browser
ar: فتح في المتصفح
fr: Ouvrir dans le Navigateur
hi: ब्राउज़र में खोलें
ja: ブラウザで開く

source: Copy Link
ar: نسخ الرابط
fr: Copier le Lien
hi: लिंक कॉपी करें
ja: リンクをコピー

source: Profiles
ar: الملفات الشخصية
fr: Profils
hi: प्रोफ़ाइल
ja: プロフィール

source: Add Profile
ar: إضافة ملف شخصي
fr: Ajouter un Profil
hi: प्रोफ़ाइल जोड़ें
ja: プロフィールを追加

source: Platform
ar: المنصة
fr: Plateforme
hi: प्लेटफॉर्म
ja: プラットフォーム

source: Username / Handle
ar: اسم المستخدم / المعرف
fr: Nom d'utilisateur / Handle
hi: उपयोगकर्ता नाम / हैंडल
ja: ユーザー名 / ハンドル

source: Phone Number
ar: رقم الهاتف
fr: Numéro de Téléphone
hi: फ़ोन नंबर
ja: 電話番号

# editCell
source: Edit Cell Content
ar: تعديل محتوى الخلية
fr: Modifier le Contenu de la Cellule
hi: सेल सामग्री संपादित करें
ja: セルの内容を編集

# cellContent
source: Content (Text, Markdown, HTML)
ar: المحتوى (نص، مارك داون، HTML)
fr: Contenu (Texte, Markdown, HTML)
hi: सामग्री (टेक्स्ट, Markdown, HTML)
ja: コンテンツ (テキスト, Markdown, HTML)

source: Insert Media:
ar: إدراج وسائط:
fr: Insérer un Média :
hi: मीडिया डालें:
ja: メディアを挿入:

# youtubeHelper
source: YouTube URL Helper
ar: مساعد روابط يوتيوب
fr: Aide URL YouTube
hi: YouTube URL सहायक
ja: YouTube URLヘルパー

# youtubeDesc
source: To embed a YouTube video, paste the video URL below. We will help you extract the video ID if needed.
ar: لتضمين فيديو يوتيوب، الصق رابط الفيديو أدناه. سنساعدك في استخراج معرف الفيديو إذا لزم الأمر.
fr: Pour intégrer une vidéo YouTube, collez l'URL de la vidéo ci-dessous. Nous vous aiderons à extraire l'ID de la vidéo si nécessaire.
hi: YouTube वीडियो एम्बेड करने के लिए, नीचे वीडियो URL पेस्ट करें। हम आवश्यकतानुसार वीडियो ID निकालने में आपकी सहायता करेंगे।
ja: YouTube動画を埋め込むには、下に動画のURLを貼り付けてください。必要に応じて動画IDの抽出をお手伝いします。

source: Preview:
ar: معاينة:
fr: Aperçu :
hi: पूर्वावलोकन:
ja: プレビュー:

source: Use This Video
ar: استخدم هذا الفيديو
fr: Utiliser cette Vidéo
hi: इस वीडियो का उपयोग करें
ja: この動画を使用

source: CodePen Helper
ar: مساعد CodePen
fr: Aide CodePen
hi: CodePen सहायक
ja: CodePenヘルパー

# codepenDesc
source: Paste your CodePen URL. We will generate a preview image link for your README.
ar: الصق رابط CodePen الخاص بك. سنقوم بتوليد رابط صورة معاينة لملف README الخاص بك.
fr: Collez votre URL CodePen. Nous générerons un lien d'image d'aperçu pour votre README.
hi: अपना CodePen URL पेस्ट करें। हम आपके README के लिए एक पूर्वावलोकन छवि लिंक उत्पन्न करेंगे।
ja: CodePenのURLを貼り付けてください。README用のプレビュー画像リンクを生成します。

source: Use This Pen
ar: استخدم هذا الـ Pen
fr: Utiliser ce Pen
hi: इस पेन का उपयोग करें
ja: このPenを使用

# gistHelper
source: GitHub Gist Helper
ar: مساعد GitHub Gist
fr: Aide GitHub Gist
hi: GitHub Gist सहायक
ja: GitHub Gistヘルパー

# gistDesc
source: Paste your Gist URL or ID.
ar: الصق رابط أو معرف Gist الخاص بك.
fr: Collez votre URL ou ID Gist.
hi: अपनी Gist URL या ID पेस्ट करें।
ja: GistのURLまたはIDを貼り付けてください。

source: Use This Gist
ar: استخدم هذا الـ Gist
fr: Utiliser ce Gist
hi: इस Gist का उपयोग करें
ja: このGistを使用
